Tekla Open API Reference for Tekla Structures 2025
Plane Properties
The Plane type exposes the following members.
Properties
Name | Description
AxisX
 The X-axis of the plane.
AxisY
 The Y-axis of the plane.
Origin
 The origin of the plane.
Top
See Also
Reference
Plane Class
Tekla.Structures.Model Namespace